{
   "class_name":"Sequential",
   "config":{
      "name":"sequential_1",
      "layers":[
         {
            "class_name":"InputLayer",
            "config":{
               "batch_input_shape":[
                  null,
                  45
               ],
               "dtype":"float32",
               "sparse":false,
               "ragged":false,
               "name":"dense_5_input"
            }
         },
         {
            "class_name":"Dense",
            "config":{
               "name":"dense_5",
               "trainable":true,
               "batch_input_shape":[
                  null,
                  45
               ],
               "dtype":"float32",
               "units":45,
               "activation":"relu",
               "use_bias":true,
               "kernel_initializer":{
                  "class_name":"GlorotUniform",
                  "config":{
                     "seed":null
                  }
               },
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "kernel_regularizer":null,
               "bias_regularizer":null,
               "activity_regularizer":null,
               "kernel_constraint":null,
               "bias_constraint":null
            }
         },
         {
            "class_name":"Dropout",
            "config":{
               "name":"dropout",
               "trainable":true,
               "dtype":"float32",
               "rate":0.25,
               "noise_shape":null,
               "seed":null
            }
         },
         {
            "class_name":"Dense",
            "config":{
               "name":"dense_6",
               "trainable":true,
               "dtype":"float32",
               "units":22,
               "activation":"relu",
               "use_bias":true,
               "kernel_initializer":{
                  "class_name":"GlorotUniform",
                  "config":{
                     "seed":null
                  }
               },
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "kernel_regularizer":null,
               "bias_regularizer":null,
               "activity_regularizer":null,
               "kernel_constraint":null,
               "bias_constraint":null
            }
         },
         {
            "class_name":"Dropout",
            "config":{
               "name":"dropout_1",
               "trainable":true,
               "dtype":"float32",
               "rate":0.25,
               "noise_shape":null,
               "seed":null
            }
         },
         {
            "class_name":"Dense",
            "config":{
               "name":"dense_7",
               "trainable":true,
               "dtype":"float32",
               "units":15,
               "activation":"relu",
               "use_bias":true,
               "kernel_initializer":{
                  "class_name":"GlorotUniform",
                  "config":{
                     "seed":null
                  }
               },
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "kernel_regularizer":null,
               "bias_regularizer":null,
               "activity_regularizer":null,
               "kernel_constraint":null,
               "bias_constraint":null
            }
         },
         {
            "class_name":"Dense",
            "config":{
               "name":"dense_8",
               "trainable":true,
               "dtype":"float32",
               "units":1,
               "activation":"sigmoid",
               "use_bias":true,
               "kernel_initializer":{
                  "class_name":"GlorotUniform",
                  "config":{
                     "seed":null
                  }
               },
               "bias_initializer":{
                  "class_name":"Zeros",
                  "config":{

                  }
               },
               "kernel_regularizer":null,
               "bias_regularizer":null,
               "activity_regularizer":null,
               "kernel_constraint":null,
               "bias_constraint":null
            }
         }
      ]
   },
   "keras_version":"2.10.0",
   "backend":"tensorflow"
}